/* Welcome to the SQL mini project. You will carry out this project partly in
the PHPMyAdmin interface, and partly in Jupyter via a Python connection.

This is Tier 2 of the case study, which means that there'll be less guidance for you about how to setup
your local SQLite connection in PART 2 of the case study. This will make the case study more challenging for you:
you might need to do some digging, aand revise the Working with Relational Databases in Python chapter in the previous resource.

Otherwise, the questions in the case study are exactly the same as with Tier 1.

PART 1: PHPMyAdmin
You will complete questions 1-9 below in the PHPMyAdmin interface.
Log in by pasting the following URL into your browser, and
using the following Username and Password:

URL: https://sql.springboard.com/
Username: student
Password: learn_sql@springboard

The data you need is in the "country_club" database. This database
contains 3 tables:
    i) the "Bookings" table,
    ii) the "Facilities" table, and
    iii) the "Members" table.

In this case study, you'll be asked a series of questions. You can
solve them using the platform, but for the final deliverable,
paste the code for each solution into this script, and upload it
to your GitHub.

Before starting with the questions, feel free to take your time,
exploring the data, and getting acquainted with the 3 tables. */

In [12]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

## Questions


#### Q1: Some of the facilities charge a fee to members, but some do not.
Write a SQL query to produce a list of the names of the facilities that do. */

In [13]:
sql="""select * from Facilities where membercost > 0"""
df = pd.read_sql_query(sql, engine)
df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,0,Tennis Court 1,5.0,25.0,10000,200
1,1,Tennis Court 2,5.0,25.0,8000,200
2,4,Massage Room 1,9.9,80.0,4000,3000
3,5,Massage Room 2,9.9,80.0,4000,3000
4,6,Squash Court,3.5,17.5,5000,80

#### Q2: How many facilities do not charge a fee to members?

In [14]:
sql="""select count(distinct facid) from Facilities where membercost == 0"""
df = pd.read_sql_query(sql, engine)
df

   count(distinct facid)
0                      4

#### Q3: Write an SQL query to show a list of facilities that charge a fee to members,
where the fee is less than 20% of the facility's monthly maintenance cost.
Return the facid, facility name, member cost, and monthly maintenance of the
facilities in question.

In [15]:
sql="""
select facid, name, membercost, monthlymaintenance
from Facilities
where membercost < (monthlymaintenance * 0.2)
"""

df = pd.read_sql_query(sql, engine)
df

   facid             name  membercost  monthlymaintenance
0      0   Tennis Court 1         5.0                 200
1      1   Tennis Court 2         5.0                 200
2      2  Badminton Court         0.0                  50
3      3     Table Tennis         0.0                  10
4      4   Massage Room 1         9.9                3000
5      5   Massage Room 2         9.9                3000
6      6     Squash Court         3.5                  80
7      7    Snooker Table         0.0                  15
8      8       Pool Table         0.0                  15

#### Q4: Write an SQL query to retrieve the details of facilities with ID 1 and 5.
Try writing the query without using the OR operator.

In [16]:
sql="""
select *
from Facilities
where facid in (1,5)
"""

df = pd.read_sql_query(sql, engine)
df

,facid,name,membercost,guestcost,initialoutlay,monthlymaintenance
0,1,Tennis Court 2,5.0,25,8000,200
1,5,Massage Room 2,9.9,80,4000,3000

#### Q5: Produce a list of facilities, with each labelled as 'cheap' or 'expensive'
depending on if their monthly maintenance cost is
more than $100. Return the name and monthly maintenance of the facilities
in question.

In [17]:
sql="""
select
    name,
    monthlymaintenance,
    case when monthlymaintenance <= 100
        then 'cheap' else 'expensive'
        end as cost
from Facilities
"""
df = pd.read_sql_query(sql, engine)
df

              name  monthlymaintenance       cost
0   Tennis Court 1                 200  expensive
1   Tennis Court 2                 200  expensive
2  Badminton Court                  50      cheap
3     Table Tennis                  10      cheap
4   Massage Room 1                3000  expensive
5   Massage Room 2                3000  expensive
6     Squash Court                  80      cheap
7    Snooker Table                  15      cheap
8       Pool Table                  15      cheap

#### Q6: You'd like to get the first and last name of the last member(s) who signed up
Try not to use the LIMIT clause for your solution. */

In [18]:
sql = """
select firstname, surname as lastname
from Members
where joindate = (
    select max(joindate) from Members
)
"""

df = pd.read_sql_query(sql, engine)
df

  firstname lastname
0    Darren    Smith

#### Q7: Produce a list of all members who have used a tennis court.
Include in your output the name of the court, and the name of the member
formatted as a single column. Ensure no duplicate data, and order by
the member name. */

In [19]:
sql = """
select distinct F.name,
    case when M.firstname = 'GUEST' then
       "GUEST"
    else
       M.firstname ||" "|| M.surname
    end as member
from Bookings B
inner join Facilities F using(facid)
inner join Members M using(memid)
where F.name like 'Tennis Court%'
order by F.facid, M.memid;
"""

df = pd.read_sql_query(sql, engine)
df

              name             member
0   Tennis Court 1              GUEST
1   Tennis Court 1        Tracy Smith
2   Tennis Court 1         Tim Rownam
3   Tennis Court 1    Janice Joplette
4   Tennis Court 1     Gerald Butters
5   Tennis Court 1       Burton Tracy
6   Tennis Court 1         Nancy Dare
7   Tennis Court 1         Tim Boothe
8   Tennis Court 1    Ponder Stibbons
9   Tennis Court 1       Charles Owen
10  Tennis Court 1        David Jones
11  Tennis Court 1         Anne Baker
12  Tennis Court 1     Jemima Farrell
13  Tennis Court 1         Jack Smith
14  Tennis Court 1     Florence Bader
15  Tennis Court 1      Timothy Baker
16  Tennis Court 1       David Pinker
17  Tennis Court 1    Matthew Genting
18  Tennis Court 1        Joan Coplin
19  Tennis Court 1   Ramnaresh Sarwin
20  Tennis Court 1      Douglas Jones
21  Tennis Court 1      David Farrell
22  Tennis Court 1          John Hunt
23  Tennis Court 1      Erica Crumpet
24  Tennis Court 2              GUEST
25  Tennis Court 2       Darren Smith
26  Tennis Court 2        Tracy Smith
27  Tennis Court 2         Tim Rownam
28  Tennis Court 2    Janice Joplette
29  Tennis Court 2     Gerald Butters
30  Tennis Court 2       Burton Tracy
31  Tennis Court 2         Nancy Dare
32  Tennis Court 2         Tim Boothe
33  Tennis Court 2    Ponder Stibbons
34  Tennis Court 2       Charles Owen
35  Tennis Court 2        David Jones
36  Tennis Court 2         Anne Baker
37  Tennis Court 2     Jemima Farrell
38  Tennis Court 2         Jack Smith
39  Tennis Court 2     Florence Bader
40  Tennis Court 2      Timothy Baker
41  Tennis Court 2   Ramnaresh Sarwin
42  Tennis Court 2   Henrietta Rumney
43  Tennis Court 2      David Farrell
44  Tennis Court 2  Millicent Purview
45  Tennis Court 2          John Hunt

#### Q8: Produce a list of bookings on the day of 2012-09-14 which will cost the member (or guest) more than $30
Remember that guests have
different costs to members (the listed costs are per half-hour 'slot'), and
the guest user's ID is always 0. Include in your output the name of the
facility, the name of the member formatted as a single column, and the cost.
Order by descending cost, and do not use any subqueries. */

In [20]:
sql = """
select
    F.name as facility,
    M.firstname ||" "|| M.surname as member,
    (B.slots * F.membercost) cost
from Bookings as B
inner join Facilities as F using(facid)
inner join Members as M using(memid)
where starttime like '2012-09-14%' and memid != 0
    and (B.slots * F.membercost) > 30
UNION ALL
select F.name,  "GUEST" as member, (B.slots * F.guestcost) cost
from Bookings as B
inner join Facilities as F using(facid)
where starttime like '2012-09-14%' and memid = 0
    and (B.slots * F.guestcost) > 30
ORDER by cost desc
"""


df = pd.read_sql_query(sql, engine)
df

          facility          member   cost
0   Massage Room 2           GUEST  320.0
1   Massage Room 1           GUEST  160.0
2   Massage Room 1           GUEST  160.0
3   Massage Room 1           GUEST  160.0
4   Tennis Court 2           GUEST  150.0
5   Tennis Court 1           GUEST   75.0
6   Tennis Court 1           GUEST   75.0
7   Tennis Court 2           GUEST   75.0
8     Squash Court           GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court           GUEST   35.0
11    Squash Court           GUEST   35.0

#### Q9: This time, produce the same result as in Q8, but using a subquery.

In [21]:
sql = """
    select
         F.name as facility,
            (   select
                case when memid = 0 then 'GUEST' else firstname||" "|| surname end
                from Members M where B.memid = M.memid
            ) as member,
           case when memid = 0 then (F.guestcost * slots) else (F.membercost * slots) end as cost
    from Facilities as F
    inner join Bookings as B using (facid)
    where starttime like '2012-09-14%'
        and cost > 30
    order by cost desc
"""
df = pd.read_sql_query(sql, engine)
df

          facility          member   cost
0   Massage Room 2           GUEST  320.0
1   Massage Room 1           GUEST  160.0
2   Massage Room 1           GUEST  160.0
3   Massage Room 1           GUEST  160.0
4   Tennis Court 2           GUEST  150.0
5   Tennis Court 1           GUEST   75.0
6   Tennis Court 1           GUEST   75.0
7   Tennis Court 2           GUEST   75.0
8     Squash Court           GUEST   70.0
9   Massage Room 1  Jemima Farrell   39.6
10    Squash Court           GUEST   35.0
11    Squash Court           GUEST   35.0